Revit 2024 API
MetalType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalType" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MetalType
Visual Basic
Public Enumeration MetalType
Visual C++
public enum class MetalType
Members
Member name | Description
Aluminum
GalvanizedAlu
Chrome
Copper
Brass
Bronze
StainlessSteel
Zinc
See Also
Autodesk.Revit.DB.Visual Namespace